# Вставляйте решение под задачей

# К просмотре обязательно ---- https://www.youtube.com/watch?v=zZBiln_2FhM

# Создайте массив состоящий из 5ти словаре
tus = {
    'kara': 'ak',
    'kyzyl': 'jashyl',
    'kok': 'seryy',
    'erkek': 'ayl',
    'BMW': 'AMG',
}


# Создайте массив состоящий из 5ти массивов с любыми значениями


k = [[1],[2],[3],[4],[5]]

# Замените в ранее созданном массиве несколько значений
# --- > Здесь опишите решение
kar = [[1],[2],[3],['tuz'],['kara']]

# Создайте цикл для первого масссива
# --- > Здесь опишите решение
for s in k:
    s = s
    print(s)


# Создайте цикл для второго масссива
# --- > Здесь опишите решение
for r in kar:
    r = r
    print(r)

# Создайте массив состоящий из 10 цифр от 0 и до 20
# --- > Здесь опишите решение
z = [1, 2, 3, 4, 14, 13, 15, 16, 17, 10]

# Пройдитесь циклоом по вышесозданному муссиву и выведите все чита которые больше 10ти
# --- > Здесь опишите решение
for g in z:
    g = g
    if g > 10:
       print(g)

# Создайте словарь который содержит в себе все типы данных которые мы проходили (ключи на ваше усморение)

father = {
    'naem': 'kadyr',
    'age': '24',

}

# Создайте словарь который содержит в себе 5 разных массивов
a = {
    'age': [1,  2, 3,],
    'NAem': ['kadyr'],
    'tuz': ['kara toru'],
    'mal': [12, 13, 23,],
    'mashina': ['AMG','BMW'],

}


# Создайте условия if / else
jorgo = (3)
if jorgo > 2:
    print(jorgo)
else:
    print('emes')

# Создайте условия if / elif / else
taksi = (102)
if taksi < 90:
    print(taksi)
elif taksi > 200:
    print('jaman')
else:
    print('jakshy')


# Создайте условия if / elif / elif / else
hello = (102)
if hello > 90:
    print(hello)
elif hello > 200:
    print('jaman')
elif hello == 102:
    print(hello)
else:
    print('jakshy')


# Создайте условия цикл который проходится по массиву в который содержит в себе условия if / elif / else
kara = [2, 345, 567, 678]
for kaz in kara:
    kaz = kaz
    if kaz < 200:
        print('az')
    elif kaz > 200:
        print('kop')
    else:
        print('nege')